OdIfcGUID.generate
\details
Generates a new IFC GUID object (pseudo constructor).
\returns The generated GUID object.

OdIfcGUID.isValid
\details
Determines whether the IFC GUID value is valid.
\returns true if the value is valid; otherwise the method returns false.

OdIfcGUID.c_str
\details
Retrieves the constant raw pointer to the underlying string.
\returns A raw pointer to the C++ character array.

OdIfcGUID.op_LessThan(OdIfcGUID!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
The "less-than" operator for IFC GUID objects.
\param other [in] Another IFC GUID value to be compared with (right-hand operand).
\returns
Returns true if the IFC GUID value in string representation is not equal to another IFC GUID value in string representation and
the code of the first different symbol in the IFC GUID string is less than the code of the symbol in the same position in the other GUID string;
otherwise, the method returns false.

OdIfcGUID.op_Inequality(OdIfcGUID!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Inequality operator for IFC GUID objects.
\param other [in] Another IFC GUID value to be compared with (right-hand operand).
\returns true if the IFC GUID object is not equal to another IFC GUID object; otherwise, the method returns false.

OdIfcGUID.op_Equality(OdIfcGUID!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Comparison operator for IFC GUID objects.
\param other [in] Another IFC GUID value to be compared with (right-hand operand).
\returns true if the IFC GUID object is equal to another IFC GUID object; otherwise, the method returns false.

OdIfcGUID.op_Assign(OdGUID!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Assignment operator for IFC GUID objects.
\param other [in] A new GUID value to be assigned.
\returns A reference to the IFC GUID object modified with the assignment operation.

OdIfcGUID.op_Assign(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Assignment operator for IFC GUID objects.
\param s [in] A new IFC GUID value to be assigned represented as an ANSI string.
\returns A reference to the IFC GUID object modified with the assignment operation.

OdIfcGUID.#ctor(OdGUID!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates a new IFC GUID based on an existing OdGUID value (copy constructor).
\param other [in] An OdGUID object that is used as a base for creating the IFC GUID object.

OdIfcGUID.#ctor
\details
Creates a new IFC GUID object with default parameters.

OdIfcGUID
\details
A class that implements generating and storing global unique identifiers (GUID) for IFC objects.